# 06 Pandas Data Structures
File(s) needed: stats_exam_3_scores.csv, Applewood_2011.csv

두개의 주요한 데이터 스트럭쳐는 **Series** 와 **DataFrame** 입니다. 우린 이미 DataFrame에 대해 지난시간에 알아보았습니다. 하지만 좀 더 자세히 알아보도록 합시다!

- Pandas DataFrame
    - 사각형의 dataset. table 형태
    - columns 과 rows 가 있다.
    - 다른 여러가지 데이터들을 여러 컬럼들로 저장할 수 있다. (키, 몸무게, 나이 등등)
    - 컬럼안의 데이터들은 항상 같은 타입이어야만 한다.
- Pandas Series
    - 데이터의 한 컬럼
    - DataFrames은 여러 Series objects로 구성되어 있다.

In [1]:
import pandas as pd

### The pandas Series
pandas series는 1차원의 데이터 배열입니다. 다음과 같이 생성할 수 있습니다:

In [2]:
# 먼저 List를 생성합니다.
my_list = [2.25, 2.5, 2.75, 3.0]
my_list

[2.25, 2.5, 2.75, 3.0]

In [3]:
# list로 부터 Series를 생성합니다. 
data = pd.Series(my_list)
data

0    2.25
1    2.50
2    2.75
3    3.00
dtype: float64

위 결과에서 우리는 두 종류의 숫자열을 확인 할 수 있습니다. 왼쪽에 있는 숫자열(0,1,2,3)은 index입니다. 오른쪽에 있는 숫자열(이전에 우리가 기입했던)은 value 입니다. 이를 따로 확인할 수도 있습니다.   
`.values` 혹은 `.index` attribute를 이용하여 확인합니다.

In [4]:
# display the data values
data.values

array([2.25, 2.5 , 2.75, 3.  ])

In [5]:
# display the index values
data.index

RangeIndex(start=0, stop=4, step=1)

또한 대괄호를 이용해 index 숫자를 입력해 조회해볼 수 도 있습니다.

In [7]:
# access the value at index 1
data[1]

2.5

In [11]:
# 글자형 인덱스를 추가해봅시다. 
data = pd.Series(my_list, index = ['A','B','C','D'])
print(data)
print()
print(data['C'])

A    2.25
B    2.50
C    2.75
D    3.00
dtype: float64

2.75

In [12]:
# 또한 순서가 있지 않은 숫자들로 인덱스를 구성할 수도 있습니다
data = pd.Series(my_list, index = [9,2,1492,37])
print(data)
print()
print(data[1492])

9       2.25
2       2.50
1492    2.75
37      3.00
dtype: float64

2.75

`loc` 와 `iloc` 로 series를 자를 수도 있습니다. `loc` 는 label값 `iloc`는 position value를 사용한다는 것을 기억하세요 (대괄호는 인덱스 값에만 작용합니다.)

In [13]:
# Display what is in the data object as a reminder
data

9       2.25
2       2.50
1492    2.75
37      3.00
dtype: float64

In [14]:
# 인덱스 37를 출력하세요
data.loc[37]

3.0

In [15]:
# 위치가 3번째인 값(position value)을 출력하세요
data.iloc[3]

3.0

In [16]:
# Show just the values
data.values

array([2.25, 2.5 , 2.75, 3.  ])

In [8]:
# series의 평균을 계산해보세요
data.sum()

10.5

### Boolean subsetting in a series
대괄호를 사용하여 subset을 선택합니다. 일반적인 형식은 다음과 같습니다.
```
series_name[conditional statement]
```

"stats_exam_3_scores.csv" 파일을 읽어와보겠습니다.

In [10]:
# "stats_exam_3_scores.csv"를 리드해오겠습니다.
exam_scores = pd.read_csv("../data/stats_exam_3_scores.csv")
type(exam_scores)

pandas.core.frame.DataFrame

In [11]:
exam_scores.head()

   scores
0   102.5
1    95.0
2   127.5
3   115.0
4   105.0

In [14]:
# 데이터를 scores라는 이름의 series로 추출해내겠습니다.
scores = exam_scores['scores']
type(scores)

pandas.core.series.Series

In [15]:
# scores series를 출력합니다.
print(scores)
# describe method를 사용하여 우리가 사용할 scores 오브젝트의 정보를 확인합니다.
print()
print(scores.describe())

0      102.5
1       95.0
2      127.5
3      115.0
4      105.0
5      100.0
6       92.5
7      145.0
8      140.0
9      107.5
10     112.5
11     100.0
12     110.0
13     110.0
14      92.5
15     102.5
16     110.0
17     135.0
18     125.0
19     115.0
20     137.5
21     102.5
22     110.0
23     102.5
24     107.5
25     105.0
26     122.5
27     132.5
28     112.5
29     100.0
       ...
351    115.0
352    120.0
353    107.5
354    117.5
355    130.0
356    120.0
357    110.0
358    120.0
359    130.0
360    135.0
361    130.0
362    110.0
363    110.0
364    115.0
365    117.5
366    137.5
367    125.0
368    127.5
369    112.5
370    132.5
371    120.0
372    112.5
373    130.0
374    102.5
375    125.0
376    100.0
377    135.0
378    150.0
379    137.5
380    115.0
Name: scores, Length: 381, dtype: float64

count    381.000000
mean     113.372703
std       15.197479
min       47.500000
25%      105.000000
50%      115.000000
75%      122.500000
max      150.000000
Name: scores, dtype: float64

In [16]:
# 145보다 큰 점수를 가진 데이터들의 Subset을 추출해보겠습니다.
scores[scores >= 145]

7      145.0
126    150.0
153    145.0
228    150.0
243    145.0
261    145.0
378    150.0
Name: scores, dtype: float64

In [17]:
# 조건이 성립하는지 결과를 보기위해 print() 를 사용해봅시다!
print(scores >= 145)

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7       True
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
351    False
352    False
353    False
354    False
355    False
356    False
357    False
358    False
359    False
360    False
361    False
362    False
363    False
364    False
365    False
366    False
367    False
368    False
369    False
370    False
371    False
372    False
373    False
374    False
375    False
376    False
377    False
378     True
379    False
380    False
Name: scores, Length: 381, dtype: bool

scores[scores >= 145] 구문은 시리즈안에 있는 145보다 큰 데이터들의 subset을 출력합니다.   

위 구문은 다음과 같은 프로세스를 따릅니다   
- `scores` 안에 있는 값들을 확인해봅니다.
- (위의 결과처럼) 145보다 크거나 같으면 `TRUE` 아닐경우 `FALSE` 값이 들어있는 Boolean series를 생성합니다.
- `TRUE` 값을 가진 모든 행들에 대응하는 위치에있는 값들을 subset으로 만들어 출력합니다!

In [18]:
# 하위 60퍼센트 점수를 출력해봅시다!
#    위 경우 하위 60퍼센트는 90점 이하입니다.
scores[scores <= 90]

56     90.0
57     87.5
59     75.0
70     90.0
74     67.5
78     80.0
81     77.5
87     87.5
98     57.5
112    80.0
121    77.5
147    87.5
174    85.0
183    77.5
200    85.0
204    85.0
216    80.0
219    87.5
298    85.0
301    47.5
310    90.0
311    85.0
313    80.0
321    90.0
339    67.5
348    82.5
Name: scores, dtype: float64

### Wait a minute .... where's the loop?
만약 우리가 판다스를 사용하지않고 코딩을 했다면 반복문을 사용하여 일일히 90보다 작은지 아닌지를 대조한 후 출력했을 것입니다.    
우리가 판다스에서 사용하는 많은 메소드들은 벡터화된 데이터들을 이용합니다. 즉 전체 데이터 스트럭쳐에서 메소드가 작동하는 것입니다. 바꿔말하면 메소드 안에 루프문이 빌트인 되어있는거라고 보면 됩니다.

In [19]:
# 상위 80% (120점) 를 새로운 series인 "above_80" 에 저장합니다.
# TIP: quantile() method는 퍼센테이지를 구하는 메소드입니다.
above_80 = scores[scores >= scores.quantile(0.8)]
above_80.describe()

count     90.000000
mean     132.250000
std        6.545541
min      125.000000
25%      127.500000
50%      130.000000
75%      135.000000
max      150.000000
Name: scores, dtype: float64

In [20]:
scores.quantile(0.8)

125.0

In [25]:
scores[scores == scores.quantile(0.8)]

18     125.0
58     125.0
72     125.0
85     125.0
91     125.0
124    125.0
141    125.0
180    125.0
203    125.0
213    125.0
248    125.0
250    125.0
260    125.0
287    125.0
290    125.0
295    125.0
318    125.0
367    125.0
375    125.0
Name: scores, dtype: float64

## The pandas DataFrame
여태까지 진행하면서 보셨듯이, DataFrame은 2차원의 데이터 스트럭쳐입니다.(서로 다른 타입을 가진 컬럼들의 모임) 엑셀 스프레드시트나 SQL테이블, 파이썬의 딕셔너리와 같은 구조라고 볼 수 있습니다.   

이는 가장 일반적으로 사용하는 판다스 오브젝트입니다.

In [26]:
# Example: 딕셔너리를 이용하여 데이터프레임 만들기
# Python 딕셔너리는 key값과 value값으로 이루어져 있습니다. 아래에선 value는 list형식으로 되어있으며
# key는 컬럼 이름으로 사용되고 있습니다

pythons = pd.DataFrame({
    'Name':['Michael', 'John', 'Graham', 'Eric'],
    'Office':['COB 305M','COB 305J','COB 305G','COB 305E'],
    'Age':[59, 66, 70,72],
    'Favorite':['Finland','Ministry of Silly Walks',"What's All This Then?",'The Galaxy Song']})

pythons

      Name    Office  Age                 Favorite
0  Michael  COB 305M   59                  Finland
1     John  COB 305J   66  Ministry of Silly Walks
2   Graham  COB 305G   70    What's All This Then?
3     Eric  COB 305E   72          The Galaxy Song

### What part of this table is the actual data?

---

기본적으로 우리는 row index로 integer(정수)를 취합니다.   
하지만 만약 우리가 'Name' 컬럼을 row label(행 이름)로 사용하고 싶다면 어떻게 할까요? 'Name' value들을 index parameter로 옮겨보도록 하죠. 각 위치값은 여전히 숫자이지만 각각의 행마다 특정한 인덱스 이름(lable)을 지정할 수 있습니다.

예를 한번 봅시다!

In [24]:
# 행이름을 인덱스 파라미터로 만듭니다.
# 데이터 프레임을 만들때 인덱스 지정을 위해 특정한 컬럼을 만들어줍니다.
pythons = pd.DataFrame(
    data = {'Office':['COB 305M','COB 305J','COB 305G','COB 305E'],
            'Age':[59, 66, 70,72],
            'Favorite':['Cheese Shop','Ministry of Silly Walks',"What's All This Then?",'Wink wink nudge nudge']},
    index = ['Michael', 'John', 'Graham', 'Eric'],
    columns = ['Age','Favorite','Office'])
pythons

         Age                 Favorite    Office
Michael   59              Cheese Shop  COB 305M
John      66  Ministry of Silly Walks  COB 305J
Graham    70    What's All This Then?  COB 305G
Eric      72    Wink wink nudge nudge  COB 305E

### What part of _this_ table is the actual data? What has changed? 

---

In [28]:
# index value를 조회해봅시다
pythons.index

Index(['Michael', 'John', 'Graham', 'Eric'], dtype='object')

In [29]:
# 인덱스(label)를 이용하여 row를 추출해봅시다 
my_row = pythons.loc['Eric']
print(my_row,'\n')
print(type(my_row))

Age                            72
Favorite    Wink wink nudge nudge
Office                   COB 305E
Name: Eric, dtype: object

<class 'pandas.core.series.Series'>

In [30]:
# 인덱스 위치 번호를 이용해서 row를 추출해봅시다
pythons.iloc[1]

Age                              66
Favorite    Ministry of Silly Walks
Office                     COB 305J
Name: John, dtype: object

각각의 row는 하나의 entity(개체)의 인스턴스입니다. 또한 각각의 column은 하나의 entity의 attribute(속성)입니다. 위의 경우는, 테이블은 Monty python의 멤버입니다.(entity) 각 행은(row) 각 멤버 하나하나의 데이터입니다. 열은(column) 멤버들의 속성이라고 볼 수 있습니다.

각각의 컬럼은 동일한 데이터 타입을 갖고 있는 series라고 볼 수 있습니다.

In [31]:
# Age column의 부분집합
pythons_age = pythons['Age']
pythons_age

Michael    59
John       66
Graham     70
Eric       72
Name: Age, dtype: int64

In [32]:
# Favorite column의 부분집합
pythons_fav = pythons['Favorite']
pythons_fav

Michael                Cheese Shop
John       Ministry of Silly Walks
Graham       What's All This Then?
Eric         Wink wink nudge nudge
Name: Favorite, dtype: object

In [33]:
# pythons_fav의 데이터 타입은 무엇인가요?
type(pythons_fav)

pandas.core.series.Series

In [34]:
# index 값은 무엇인가요?
pythons.index

Index(['Michael', 'John', 'Graham', 'Eric'], dtype='object')

In [35]:
# column names을 출력하세요
pythons.columns

Index(['Age', 'Favorite', 'Office'], dtype='object')

In [36]:
# data values를 출력하세요
pythons.values

array([[59, 'Cheese Shop', 'COB 305M'],
       [66, 'Ministry of Silly Walks', 'COB 305J'],
       [70, "What's All This Then?", 'COB 305G'],
       [72, 'Wink wink nudge nudge', 'COB 305E']], dtype=object)

또한 하나의 행에 index 넘버로 엑세스할수 있습니다.

In [37]:
# values attribute를 이용하여 index넘버 2인 행을 출력하세요
pythons.values[2]

array([70, "What's All This Then?", 'COB 305G'], dtype=object)

In [38]:
# column name을 출력하는 걸 응용해볼까요?
pythons.columns[2]

'Office'

만약 key로 행을 조회하고 싶다면 **_slicing_** 을 이용합니다. 슬라이싱을 이용하면 데이터에 있는 행들의 부분집합을 선택할 수 있습니다.

key로 슬라이싱을 하면 오른쪽은 포함입니다!

In [39]:
# Example: slicing
pythons['Eric':'Eric']

      Age               Favorite    Office
Eric   72  Wink wink nudge nudge  COB 305E

In [40]:
pythons['Michale':'John']

         Age                 Favorite    Office
Michael   59              Cheese Shop  COB 305M
John      66  Ministry of Silly Walks  COB 305J

In [41]:
# row 넘버로 슬라이싱을 할 수도 있습니다.
# 그때는 오른쪽은 미포함됩니다!
pythons[1:3]

        Age                 Favorite    Office
John     66  Ministry of Silly Walks  COB 305J
Graham   70    What's All This Then?  COB 305G

이전에 Series에서 했던거처럼, 조건을 통해 특정 행들을 가져올 수 있습니다.

In [28]:
# Age > 67 라는 조건을 이용합니다.
# 컬럼이름에 . 을 붙여야 합니다.
pythons[pythons['Age'] > 67]

        Age               Favorite    Office
Graham   70  What's All This Then?  COB 305G
Eric     72  Wink wink nudge nudge  COB 305E

In [25]:
pythons[pythons.Age == 70]

        Age               Favorite    Office
Graham   70  What's All This Then?  COB 305G

좀 더 큰 데이터 셋으로 연습을 해보겠습니다. "Applewood_2011.csv" data를 "cars"라는 데이터 프레임으로 읽어와주세요!

In [29]:
cars = pd.read_csv("../data/Applewood_2011.csv")
cars.describe()

              Age       Profit    Previous
count  180.000000   180.000000  180.000000
mean    45.883333  1843.166667    1.016667
std     10.541896   643.627694    0.988622
min     21.000000   294.000000    0.000000
25%     40.000000  1422.500000    0.000000
50%     46.000000  1882.500000    1.000000
75%     52.250000  2268.500000    1.000000
max     73.000000  3292.000000    4.000000

In [45]:
# age > 67 인 부분집합을 만들어서 sub_cars 라는 이름으로 저장하세요
sub_cars = cars[cars.Age > 67]
sub_cars

     Age  Profit   Location Vehicle-Type  Previous
174   68    1837  Sheffield        Sedan         1
175   69    2842       Kane          SUV         0
176   70    2434      Olean        Sedan         4
177   72    1640      Olean        Sedan         1
178   72    1821   Tionesta          SUV         1
179   73    2487      Olean      Compact         4

In [46]:
# location이 Olean 인 행들을 검색하여 부분집합을 만드세요
sub_cars_loc = sub_cars[sub_cars.Location == 'Olean']
sub_cars_loc

     Age  Profit Location Vehicle-Type  Previous
176   70    2434    Olean        Sedan         4
177   72    1640    Olean        Sedan         1
179   73    2487    Olean      Compact         4

In [47]:
# 위 subset에서 최소 3번의 구매기록(Previous)가 있는 고객들을 검색하여 부분집합을 만드세요
sub_cars_loc_pre = sub_cars_loc[sub_cars_loc.Previous >= 3]
sub_cars_loc_pre

     Age  Profit Location Vehicle-Type  Previous
176   70    2434    Olean        Sedan         4
179   73    2487    Olean      Compact         4

### 행 추가하기
대개 새로운 행을 추가하고 싶으면 오리지널 데이터셋에 데이터를 추가하고 다시 불러들이는 방법을 사용합니다.   
하지만 이미 존재하는 DataFrame에 새로운 Row를 추가하는 방법이 있습니다.  데이터 로우를 추가하는 방법이 있습니다. `append()` 메소드를 이용하면 기존의 데이터프레임에 새로운 로우를 추가할 수 있습니다.

In [30]:
# Spam을 가장 좋아하고, 오피스는 COB 305T이며 나이는 63인 Terry라는 사람의 행을 추가해봅시다
# 우선, 딕셔너리를 이용하여 새로운 데이터프레임을 만드세요

new_row = pd.DataFrame(
    data = [{'Favorite':'Spam','Age':63,'Office':'COB 305T'}],
    index= ['Terry'])
new_row

       Age Favorite    Office
Terry   63     Spam  COB 305T

In [31]:
# append 메소드를 이용하여 위의 데이터를 데이터프레임에 넣으세요

pythons = pythons.append(new_row)

In [32]:
# index 값을 확인하세요
pythons.index

Index(['Michael', 'John', 'Graham', 'Eric', 'Terry'], dtype='object')

### Adding columns
우리가 column을 추가할때, 판다스는 인덱스를 key 밸류에 자동으로 매치합니다. 

새로운 데이터 시리즈를 만들어 확인해봅시다

In [35]:
# 위의 데이터프레임에 관련된 데이터 시리즈를 하나 임의로 만듭니다
new_data = pd.Series([10.5,12,10,9.5,9.0], index = ['Graham','John','Terry','Eric','Michael'])
new_data

Graham     10.5
John       12.0
Terry      10.0
Eric        9.5
Michael     9.0
dtype: float64

In [33]:
# 데이터를 추가하기 이전에, 기존의 데이터프레임이 어떻게 생겼는지 볼까요?
pythons

         Age                 Favorite    Office
Michael   59              Cheese Shop  COB 305M
John      66  Ministry of Silly Walks  COB 305J
Graham    70    What's All This Then?  COB 305G
Eric      72    Wink wink nudge nudge  COB 305E
Terry     63                     Spam  COB 305T

In [36]:
# 새로운 컬럼을 만들어서 그 컬럼에 방금 만든 new_data를 추가해봅시다
pythons['Shoe_size'] = new_data
pythons

         Age                 Favorite    Office  Shoe_size
Michael   59              Cheese Shop  COB 305M        9.0
John      66  Ministry of Silly Walks  COB 305J       12.0
Graham    70    What's All This Then?  COB 305G       10.5
Eric      72    Wink wink nudge nudge  COB 305E        9.5
Terry     63                     Spam  COB 305T       10.0

저희가 new_data 데이터시리즈를 만들때 데이터의 순서를 기억하시나요? 저희가 입력한 순서와는 관계없이 데이터프레임에 있던 index순서에 따라 저희가 추가한 데이터가 매치되었습니다!

### Dropping columns
데이터 셋에 있는 컬럼중에 필요없어서 지우고 싶은 컬럼이 있을 것입니다. 그럴 경우 `drop()` 메소드를 이용해 컬럼을 지울 수 있습니다. 하지만 특수한 경우가 아닌이상 데이터셋의 원본은 지우지 않고 놔두는 편이 좋습니다!

In [37]:
# 금방 만든 shoe_size컬럼을 지워보도록 하겠습니다.
pythons.drop('Shoe_size', axis = 1)

         Age                 Favorite    Office
Michael   59              Cheese Shop  COB 305M
John      66  Ministry of Silly Walks  COB 305J
Graham    70    What's All This Then?  COB 305G
Eric      72    Wink wink nudge nudge  COB 305E
Terry     63                     Spam  COB 305T

In [38]:
# 컬럼을 드랍 후에 다시 pythons 데이터프레임을 확인해보겠습니다.
pythons

         Age                 Favorite    Office  Shoe_size
Michael   59              Cheese Shop  COB 305M        9.0
John      66  Ministry of Silly Walks  COB 305J       12.0
Graham    70    What's All This Then?  COB 305G       10.5
Eric      72    Wink wink nudge nudge  COB 305E        9.5
Terry     63                     Spam  COB 305T       10.0

보시는 바와같이, 기존 데이터프레임에서는 드랍했던 컬럼이 다시 존재합니다. drop 메소드는 저장하지 않는 것이 기본값으로 설정되어 있기 때문입니다. 이 경우 저희는 2가지를 선택할 수 있습니다.
1. 새로운 데이터프레임에 결과값을 저장하기
2. `inplace=True`파라미터를 이용하여 기존 데이터프레임에 변경을 저장하기

In [40]:
# inplace=True 를 추가해 변경된 것을 저장하세요
pythons.drop('Shoe_size', axis = 1, inplace = True)

In [41]:
pythons

         Age                 Favorite    Office
Michael   59              Cheese Shop  COB 305M
John      66  Ministry of Silly Walks  COB 305J
Graham    70    What's All This Then?  COB 305G
Eric      72    Wink wink nudge nudge  COB 305E
Terry     63                     Spam  COB 305T

여러 컬럼을 한번에 지우고 싶다면 List를 사용해서 drop을 해줍시다

In [57]:
# Location 과 Previous 컬럼을 Applewood 데이터프레임에서 지워봅시다.
cars.drop(['Location','Previous'], axis = 1)

# 결과값에 만족한다면 새로운 데이터프레임을 만들어서 결과값을 저장해봅시다.
cars_drop = cars.drop(['Location','Previous'], axis = 1)
cars_drop

     Age  Profit Vehicle-Type
0     21    1387        Sedan
1     23    1754          SUV
2     24    1817       Hybrid
3     25    1040      Compact
4     26    1273        Sedan
5     27    1529        Sedan
6     27    3082        Truck
7     28    1951          SUV
8     28    2692      Compact
9     29    1206        Sedan
10    29    1342        Sedan
11    30     443        Sedan
12    30     754        Sedan
13    30    1621        Truck
14    31     870        Sedan
15    31    1174        Truck
16    31    1412        Sedan
17    31    1809        Sedan
18    31    2415        Sedan
19    32    1546        Truck
20    32    2148          SUV
21    32    2207      Compact
22    32    2252          SUV
23    33    1428          SUV
24    33    1889          SUV
25    34    1166        Sedan
26    34    1320        Sedan
27    34    2265        Sedan
28    35    1323        Sedan
29    35    1760        Sedan
..   ...     ...          ...
150   56    1957          SUV
151   56    2240        Sedan
152   56    2695        Sedan
153   57    1325        Sedan
154   57    2250        Sedan
155   57    2279       Hybrid
156   57    2626        Sedan
157   58    1501       Hybrid
158   58    1752        Sedan
159   58    2058          SUV
160   58    2370      Compact
161   58    2637          SUV
162   59    1426        Sedan
163   59    2944          SUV
164   60    2147        Sedan
165   61    1973          SUV
166   61    2502        Sedan
167   62     783       Hybrid
168   62    1538        Truck
169   63    2339      Compact
170   64    2700        Truck
171   65    2222        Truck
172   65    2597        Truck
173   65    2742          SUV
174   68    1837        Sedan
175   69    2842          SUV
176   70    2434        Sedan
177   72    1640        Sedan
178   72    1821          SUV
179   73    2487      Compact

[180 rows x 3 columns]

### More about data file access

---
#### Pickling
위와 같이 수정된 데이터프레임을 하드디스크에 새로 저장하고 싶을 때가 있습니다. 그 경우 **_pickling_** 을 이용합니다.  Pickling 은 파이썬이 데이터를 이진 파일로 저장하는 방법입니다!

만약 데이터를 다른 프로그램에서 사용하고 싶을때 유용하게 사용할 수 있을 것입니다. 하지만 pickle데이터는 파이썬에서 밖에 사용할 수 없습니다.

In [73]:
# 데이터프레임을 pickle형식으로 저장하세요- 파일이름과 경로를 상세하게 적어야합니다.

pythons.to_pickle('../data/Working_data.pickle')

In [75]:
# pickle데이터를 읽어오는 방식입니다.
pythons2 = pd.read_pickle('/Users/eastone/Desktop/UCA/progrmming_in_python/data/Working_data.pickle')
pythons2

         Age                 Favorite    Office
Michael   59              Cheese Shop  COB 305M
John      66  Ministry of Silly Walks  COB 305J
Graham    70    What's All This Then?  COB 305G
Eric      72    Wink wink nudge nudge  COB 305E
Terry     63                     Spam  COB 305T

#### CSV files
쉼표로 구분된 값 (CSV) 파일은 데이터 저장에 있어 매우 flexible한 유형입니다. 단순히 각 행 요소들 사이에 쉼표로 구분되어져 있는 기본 텍스트 파일이며, 어떤 프로그램으로도 열 수 있습니다. 이미 우리는 `pd.read_csv` 를 이용하여 csv파일을 로드해왔었습니다. DataFrame 과 Series 객체는 csv파일로 내보내어 저장할 수 있는`to_csv()` 메소드가 내장되어 있습니다.

In [76]:
# dataframe을 csv파일로 저장해보세요!
cars.to_csv('/Users/eastone/Desktop/UCA/progrmming_in_python/data/cars_df.csv')

In [77]:
# row index없이 csv파일을 저장할 수 있습니다.
# CAUTION: 로우 인덱스는 상당히 중요한 역할을 합니다. 따라서 로우 인덱스가 필요없는 상황에서만 해주세요
cars.to_csv('/Users/eastone/Desktop/UCA/progrmming_in_python/data/cars_df.csv', index = False)

#### Excel files
<p style="font-size:125%;padding:35px;text-align:center;background-color:dodgerblue;color:white">You should stick with CSV files as much as possible. If you have data in an Excel spreadsheet, you will usually be better off if you use Excel to save it in CSV format and then work with the CSV file.</p>

However, pandas can read Excel files directly. The following is provided for your reference.

The `read_excel()` method in pandas can read Excel 2003 (.xls) and Excel 2007+ (.xlsx) files using the xlrd Python module. The `to_excel()` instance method is used for saving a DataFrame to Excel. Generally the semantics are similar to working with csv data.

In the most basic use-case, `read_excel` takes a path to an Excel file, and the sheet_name indicating which sheet to parse. You can also specify a column to use as the index values and how to handle missing data.

```
# Returns a DataFrame
read_excel('path_to_file.xls', sheet_name='Sheet1')
```

Using more of the available arguments:
```
Using the sheet name, specifying the index, and missing values as NA:
  read_excel('path_to_file.xls', 'Sheet1', index_col=None, na_values=['NA'])

Using the sheet index, specifying the index, and missing values as NA:
  read_excel('path_to_file.xls', 0, index_col=None, na_values=['NA'])

Using all default values:
  read_excel('path_to_file.xls')

Using None to get all sheets:
  read_excel('path_to_file.xls', sheet_name=None)

Using a list to get multiple sheets:
Returns the 1st and 4th sheet, as a dictionary of DataFrames.
  read_excel('path_to_file.xls', sheet_name=['Sheet1', 3])
```

As you see in the last two entries, `read_excel` can read more than one sheet at a time by setting sheet_name to either a list of sheet names, a list of sheet positions, or None to read all sheets. Sheets can be specified by sheet index or sheet name, using an integer or string, respectively.

#### Database files
pandas also has built-in capabilities for reading database files. Many of the best known databases rely on SQL and pandas leverages SQL for data access. The library `sqlalchemy` provides these functions for SQL databases like SQLite, MySQL, SQL Server, and MS Access (through the ODBC standard). We will not have time to cover these in class but you should be aware of them for future use.